import "./App.css";
import { useEffect } from "react";
import { useTelegram } from "./hooks/useTelegram";
import Header from "./components/Header/Header";
import { Route, Routes } from "react-router-dom";

function App() {
	const { onToggleButton, tg } = useTelegram();

	useEffect(() => {
		tg.ready();
	}, []);

	return (
		<div className="App">
			<Header />
			<h1>
				Як підготуватися до донації крові: харчування та інші важливі аспекти
			</h1>
			<p>
				Їжа, спожита донором перед здачею крові, має надзвичайно важливе
				значення. Якщо у вас виявлять певні речовини в крові, то її просто не
				переллють пацієнтам. Лише один горішок, шматочок халви чи ще якийсь
				дрібний смаколик може все зіпсувати. До вашої уваги стаття про те, що
				можна та не можна вживати перед донацією.
			</p>
			<h2>Що не рекомендують їсти перед донацією?</h2>
			<p>
				Склад раціону, вживання алкоголю чи ліків можуть уплинути на певні
				показники крові, тому радимо відмовитися від нижченаведеного списку
				продуктів або препаратів:{" "}
			</p>
			<ol>
				<li>молочні продукти та яйця – за добу до донації;</li>
				<li>горіхи, фініки та банани – 24 год;</li>
				<li>соління – 24 год;</li>
				<li>ковбасні вироби – 36 год;</li>
				<li>копчена, гостра, пряна та смажена їжа – 48 год;</li>
				<li>буряк – 48 год;</li>
				<li>
					чипси, сухарики, халва, насіння, снеки, солодкі магазинні напої,
					кетчуп, майонез, інші магазинні соуси та маринади – 48 год;
				</li>
				<li>алкоголь, енергетичні напої – 48 год;</li>
				<li>чорниця – 72 год;</li>
				<li>
					лікарські засоби – 24-72 год, щодо винятків краще порадитися з
					лікарем.
				</li>
			</ol>
			<p>
				Куріння – ворог здоров'я не тільки донора, а й пацієнта, який отримує
				таку кров. Утриматися від паління слід мінімум за дві години до донації
				та дві години після. Небажано також перед здачею крові пити каву –
				принаймні протягом 4-5 годин. Оскільки кофеїн звужує судини, у донора
				може бути важче взяти необхідну кількість крові. Утриматися від
				кавування варто також протягом 12 годин після донації, так як кофеїн має
				сечогінний ефект, а для донора важливо підтримувати достатню кількість
				рідини в організмі, аби швидше та якісніше відновити кров.
			</p>
		</div>
	);
}

export default App;
